app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(app_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-03-01 18:23:05.878405"], ["id", 1]]

  def create
    @student = Student.create(app_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-03-01 17:27:49.243412"], ["updated_at", "2019-03-01 17:27:49.243412"]]